# TableMergedCell Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableMergedCell Constructor
TableMergedCell Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TableMergedCell()()()() | Default constructor. |
| TableMergedCell(Int32, Int32, Int32, Int32) | Constructor. |

# See Also
TableMergedCell Class
TableMergedCell Members
Autodesk.Revit.DB Namespace